src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="98375782-7122-4eef-88e9-13504abb6f3d">
  <name>СписаниеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6c3f5130-070f-4922-8828-aa5f705dd12d">
    <name>ИнвентаризацияТоваровНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f10b402-ea5e-4007-a708-f4dbb1bd4dba">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="20eefe7e-c45a-4c39-8963-bd3a5c028835">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55ccc6a2-4228-45bc-9a73-a76ce0908ff0">
    <name>ПодразделениеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2619cbea-9f3f-4850-a223-d5e971abf766">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="03ce342f-765c-4071-b6f4-e62b95fd1311">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1ffed464-ff21-4110-9e6c-5b7733fede53">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1c31223b-542e-4674-aca6-bb6e60869ff1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9b7c1dab-36a4-4548-8780-c17231c64f95">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2617b3df-3611-41a6-a84f-5a12ba9e46f5">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb2a6d05-98b2-43d4-95a9-a339e7d5907d">
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93827d4d-4945-4bb5-a5ac-f3a851a08410">
      <name>СчетУчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b0065be6-1204-4ac9-9dcd-e4414e09a9b4">
      <name>КоличествоМест</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2eefb24a-455a-43f8-80bd-d4946f22677c">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3cfca87a-1b5d-434f-b7e7-4ad671c998ce">
    <name>ВозвратнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3f19208d-64df-402f-b87c-114297434ec8">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="944170fe-0171-4826-858f-c1418ccb12c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СписаниеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Базар_ПриОткрытииПосле(Отказ)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&Вместо("УстановитьУсловноеОформлениеВидимость")
Процедура Базар_УстановитьУсловноеОформлениеВидимость()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ТоварыЦена, ТоварыСумма, ГруппаИтоги
	Если НЕ ЗначениеЗаполнено(Объект.ИнвентаризацияТоваровНаСкладе) тогда
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыЦена");
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыСумма");
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГруппаИтоги");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"НТТ", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	КонецЕсли;
	
	// ТоварыСтавкаНДСВРознице
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыСтавкаНДСВРознице");
	
	ГруппаОтбора1 = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
			"НТТ", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
			"УчетВПродажныхЦенах", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
			"РазделятьПоСтавкамНДС", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	// ТоварыСчетУчета
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыСчетУчета");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НТТ", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"УчетВПродажныхЦенах", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	
	// ТоварыДокументОприходования
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыДокументОприходования");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СпособОценкиМПЗПоСредней", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&Вместо("УправлениеФормой")
Процедура Базар_УправлениеФормой(Форма)

	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.ИнвентаризацияТоваровНаСкладе) тогда
		Элементы.ТоварыЦена.ТолькоПросмотр = Истина;
		Элементы.ТоварыСумма.ТолькоПросмотр = Истина;
		Элементы.ГруппаИтоги.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.ПодразделениеОрганизации.Доступность		= ЗначениеЗаполнено(Объект.Организация);
	Элементы.ИнвентаризацияТоваровНаСкладе.Доступность	= ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.Склад);

КонецПроцедуры

&Вместо("УстановитьВидимостьНаСервере")
Процедура Базар_УстановитьВидимостьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ИнвентаризацияТоваровНаСкладе) тогда
		Элементы.ТоварыЦена.ТолькоПросмотр = НТТ;
		Элементы.ТоварыСумма.ТолькоПросмотр = НТТ;
		Элементы.ГруппаИтоги.Видимость = НТТ;
	Иначе
		Элементы.ТоварыЦена.ТолькоПросмотр = Истина;
		Элементы.ТоварыСумма.ТолькоПросмотр = Истина;
		Элементы.ГруппаИтоги.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Базар_ИнвентаризацияТоваровНаСкладеПриИзмененииВместо(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИнвентаризацияТоваровНаСкладе) тогда
		ТекстВопроса = НСтр("ru = 'Заполнить документ списание товаров, на основании инвентаризации товаров?'");
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗаполнитьНаОснованииИнвентаризации", ЭтотОбъект, Неопределено);
		ПоказатьВопрос(Оповещение,
		               ТекстВопроса,
		               РежимДиалогаВопрос.ДаНет,
		               30,
		               КодВозвратаДиалога.Да,
		               "Заполнить на основании инвентаризации?",
		               КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	УстановитьУсловноеОформлениеВидимость();
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗаполнитьНаОснованииИнвентаризации(Ответ, ДополнительныеНастройки) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоИнвентаризации(Команды.Найти("ЗаполнитьПоИнвентаризации"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнвентаризацияТоваровНаСкладеОбработкаВыбораВместоНаСервере(ВыбранноеЗначение)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) тогда
		
		ТекстСообщения = "";
		Если НЕ ВыбранноеЗначение.Проведен тогда
			ТекстСообщения = НСтр("ru = 'Выбранный Вами документ """ + ВыбранноеЗначение + """ не проведен.'");
			
		ИначеЕсли ВыбранноеЗначение.Дата > Объект.Дата тогда
			ТекстСообщения = НСтр("ru = 'Дата выбранного Вами документа """ + ВыбранноеЗначение + """ больше, чем дата списания товаров.'");
			
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ключ, "Объект.ИнвентаризацияТоваровНаСкладе");
			ВыбранноеЗначение = ПредопределенноеЗначение("Документ.СписаниеТоваров.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Базар_ИнвентаризацияТоваровНаСкладеОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИнвентаризацияТоваровНаСкладеОбработкаВыбораВместоНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры
